## 자료형별 연산

In [1]:
import pandas as pd
import numpy as np

#### 1.시리즈의 사칙연산

In [28]:
st1=pd.Series({'국어':100,'수학':85,'영어':80})   # 국어, 수학, 영어 가 인덱스인 3행 1열 
st2=pd.Series({'국어':87,'수학': 65, '영어':100})

add=st1+st2
sub=st1-st2
mul=st1*st2
div=np.round(st1/st2,2)       #소수점자리  둘째까지
print(add,  sub, mul, div ,sep='\n\n',)

국어    187
수학    150
영어    180
dtype: int64

국어    13
수학    20
영어   -20
dtype: int64

국어    8700
수학    5525
영어    8000
dtype: int64

국어    1.15
수학    1.31
영어    0.80
dtype: float64

In [33]:
#사칙연산된 Series를 DataFrame으로 변환
df=pd.concat([add,sub,mul,div], axis=1)    #열 기준 변환이라고 지정이 필요함
df.rename(columns={0:'add',1:'sub',2:'mul',3:'div'},inplace=True)
df

df2=pd.DataFrame([add,sub,mul,div],index=['add','sub','mul','div'])    #key값이 열로 가게 변환됨
df2

          국어       수학      영어
add   187.00   150.00   180.0
sub    13.00    20.00   -20.0
mul  8700.00  5525.00  8000.0
div     1.15     1.31     0.8

#### 2. 배열의 연산

In [43]:
#1차원 배열
ar=np.arange(1,11)
ar2=np.arange(11,21)

add=ar+ar2
sub=ar-ar2
mul=ar*ar2
div=np.round(ar/ar2,2)

#broad casting
ar-ar2[1]

array([-11, -10,  -9,  -8,  -7,  -6,  -5,  -4,  -3,  -2])

In [48]:
#2차원 배열
ar1=ar.reshape(2,5)[1]
ar3=np.random.randint(1,50,size=(4,5))


#broad casting
ar3-ar1
ar3-ar1[0]

array([[ 8, 23, 29, 13, 14],
       [12, -2,  8, 18,  0],
       [26, 27,  8, 35, -4],
       [39, 18, 33,  8, 25]])

#### 3. 데이터프레임과 시리즈의 연산

In [60]:
#데이터프레임의 연산
np.random.seed(0)
df=pd.DataFrame(np.random.randint(1,50,size=(4,5)), columns=['a','b','c','d','e'])
print(df)

print(df+df,'\n')
print(df-df,'\n')
print(df*df,'\n')
print(np.round(df/df,1),'\n')


#broad casting
s3=df.iloc[2]-10
print(s3)

df-s3

    a   b   c   d   e
0  45  48   1   4   4
1  40  10  20  22  37
2  24   7  25  25  13
3   2  39  40  24  47
    a   b   c   d   e
0  90  96   2   8   8
1  80  20  40  44  74
2  48  14  50  50  26
3   4  78  80  48  94

   a  b  c  d  e
0  0  0  0  0  0
1  0  0  0  0  0
2  0  0  0  0  0
3  0  0  0  0  0

      a     b     c    d     e
0  2025  2304     1   16    16
1  1600   100   400  484  1369
2   576    49   625  625   169
3     4  1521  1600  576  2209

     a    b    c    d    e
0  1.0  1.0  1.0  1.0  1.0
1  1.0  1.0  1.0  1.0  1.0
2  1.0  1.0  1.0  1.0  1.0
3  1.0  1.0  1.0  1.0  1.0

a    14
b    -3
c    15
d    15
e     3
Name: 2, dtype: int32

    a   b   c   d   e
0  31  51 -14 -11   1
1  26  13   5   7  34
2  10  10  10  10  10
3 -12  42  25   9  44

## 함수의 매핑

- 커스텀 함수를 데이터프레임에 적용하기 위해
    - map 함수: 시리즈 타입에서만 함수 적용
    - apply 함수:  데이터 프레임의 복수개의 행/열마다 요소들에 함수 적용
    - mapapply 함수: 데이터프레임 내 모든 요소들에 함수 적용

In [130]:
#데이터프레임 생성
df=pd.DataFrame(np.random.randint(1,20,size=(4,5)),columns=list('abcde'))
df

    a   b   c   d   e
0   4  16  14  17  18
1   6  10   4   1   6
2   1  18  19   5   3
3  17   4   3  11  14

In [131]:
#시리즈에 메서드 적용해보기
s1= df.iloc[0]
s1.max()
s1.min()
s1.mean()
s1.sum()
s1.median()

16.0

#### apply: 시리즈(행/열)에 함수를 적용해 하나의 요소(value) 값으로 반환

#### - 람다함수를 데이터프레임에 적용

In [134]:
#람다함수 만들기
fx=lambda x: x.max()-x.mean()


fx2=lambda x: x.max()-x

In [135]:
df.apply(fx)   #열에 대해 반환(default)

a    10.00
b     6.00
c     9.00
d     8.50
e     7.75
dtype: float64

In [136]:
df.apply(fx2)

    a   b   c   d   e
0  13   2   5   0   0
1  11   8  15  16  12
2  16   0   0  12  15
3   0  14  16   6   4

In [82]:
df.apply(fx,axis=1) #행에 대해 반환 (열끼리 함수 적용)

0    8.2
1    4.0
2    8.6
3    4.4
dtype: float64

In [137]:
df.apply(fx2,axis=1)

    a   b   c   d   e
0  14   2   4   1   0
1   4   0   6   9   4
2  18   1   0  14  16
3   0  13  14   6   3

#### - 사용자정의 함수를 데이터프레임에 적용

In [87]:
#사용자정의 함수 만들기
def f(x):
    return pd.Series([x.max(),x.min()],index=['max','min'])

In [88]:
df.apply(lambda x: f(x))  #열에 대해 반환

      a   b   c   d   e
max  15  12  15  19  16
min   5   4   5  11   1

In [89]:
df.apply(lambda x:f(x),axis=1)  #행에 대해 반환

   max  min
0   19    1
1   15    4
2   16    4
3   16    5

#### map: 함수를 시리즈에 적용해서 시리즈 요소값 전체가 나옴

#### - 람다함수를 데이터프레임에 적용

In [96]:
#람다함수 만들기
format=lambda x: '%.2f'%x     #[.2]:소수점자리 두자리
                                                      #[f]: 실수
#### - 람다함수를 데이터프레임에 적용

0     7
1    15
2     5
3    13
Name: a, dtype: int32

In [97]:
df['a']
df.iloc[:,0]
df.loc[:,'a']      #열에 함수 적용

df['a'].map(format)

0     7.00
1    15.00
2     5.00
3    13.00
Name: a, dtype: object

#### - 사용자정의 함수를 데이터프레임에 적용

In [104]:
#사용자정의함수 만들기: %로 만들기
def percent(x):
    if x/100>0.1:
        y='높음'
    else:
        y='낮음'
    return f'{y}: {x}%' #### - 사용자정의 함수를 데이터프레임에 적용

In [105]:
df.iloc[1,].map(lambda x: percent(x))

a    높음: 15%
b     낮음: 4%
c    높음: 13%
d    높음: 11%
e    높음: 12%
Name: 1, dtype: object

#### applymap: 데이터프레임 모든 요소값들에 함수 적용

#### - 람다함수를 데이터프레임에 적용

In [106]:
f=lambda x: x**2

In [107]:
df.applymap(f)

     a    b    c    d    e
0   49  144  225  361    1
1  225   16  169  121  144
2   25   49   25  256   16
3  169   25   81  225  256

#### - 사용자정의 함수를 데이터프레임에 적용

In [138]:
def f(x):
    return f'{x:08.2f}'

df.applymap(lambda x: f(x))

          a         b         c         d         e
0  00004.00  00016.00  00014.00  00017.00  00018.00
1  00006.00  00010.00  00004.00  00001.00  00006.00
2  00001.00  00018.00  00019.00  00005.00  00003.00
3  00017.00  00004.00  00003.00  00011.00  00014.00

## 과제
#### 최대한 복잡한 사용자 함수를 생성한 후 데이터프레임에 적용하여 결과를 출력할 것

In [154]:
# 데이터프레임 생성
import numpy as np
import pandas as pd

np.random.seed(10)
df=pd.DataFrame(np.random.randint(50,100,size=(10,5)),columns=['국어','수학','사회','과학','영어'])
df.head()

   국어  수학  사회  과학  영어
0  59  86  65  50  99
1  78  75  79  98  79
2  99  58  59  50  92
3  90  86  66  86  97
4  61  74  93  83  58

In [158]:
#함수 생성
def su_ga(x):
    score=''
    if x<50:
        score= '가'
    elif x<60:
        score= '양'
    elif x<70:
        score= '미'
    elif x<80:
        score= '우'
    elif x>=80:
        score= '수'    
    return score

In [157]:
#적용 결과
df.applymap(lambda x: su_ga(x))

  국어 수학 사회 과학 영어
0  양  수  미  양  수
1  우  우  우  수  우
2  수  양  양  양  수
3  수  수  미  수  수
4  미  우  수  수  양
5  수  미  수  미  양
6  미  우  미  우  우
7  수  수  우  미  양
8  수  수  우  미  우
9  미  우  우  수  미